# ''' შექმენით ფუნქცია სახელად manual_pop, რომელსაც გადაეცემა სია და ასევე შესაძლოა ინდექსი.
# როდესაც გადაეცემა ინდექსი, სიიდან უნდა ამოიშალოს ამ ინდექსზე მყოფი ელემენტი და დაბრუნდეს სია
# ამ სახით. 

# თუ ფუნქციას არ გადაეცემა index, მაშინ default მნიშვნელობა უნდა იყოს სიის ბოლო ელემენტი - 
# ზოგადად pop როგორც მუშაობს. ამ დავალებაში რათქმაუნდა pop არ უნდა გამოიყენოთ.
# '''

# # lis = [1,4,3,2,3,4], i = 3, [1,4,3,3,4]
# def manual_pop(lis,i = -1):
#     if i == -1:
#         i = len(lis)-1
#     ans = []
#     for j in range(len(lis)):
#         if j != i:
#             ans.append(lis[j])
#     # ans = [1,4,3,3,4]
#     return ans
# print(manual_pop([1,4,3,2,3,4]))


# '''
# შექმენით ფუნქცია სახელად manual_count: ფუნქციას გადაეცემა სია და ასევე შესაძლოა ელემენტი.
# როდესაც ფუნქციას ელემენტიც გადაეცემა, თქვენ უნდა დაითვალოთ სიაში ამ ელემენტის რაოდენობა, 
# არ გამოიყენოთ count. როდესაც არ გადაეცემა ელემენტი, მისთვის გამოიყენეთ default მნიშვნელობა და
# გაუტოლეთ საწყისი სიის საშუალო არითმეტიკულს, ოღონდ მთელი რიცხვის სახით (int(აქ საშუალოს კოდი)).
# '''


# def manual_count(lis, k = "NO VALUE"):
#     if k == "NO VALUE":
#         k = int(sum(lis) / len(lis))
#     cnt = 0
#     for i in lis:
#         if i == k:
#             cnt += 1
#     return cnt
# print(manual_count([1,4,3,2,4,4,6,3]))